/*
Σε αυτό το παράδειγμα, ζητάμε από τον χρήστη να εισάγει έναν βαθμό.
Στη συνέχεια, χρησιμοποιούμε τη δομή ελέγχου if-else if-else για να αξιολογήσουμε 
την τιμή του βαθμού και να εκτυπώσουμε ανάλογο μήνυμα ανάλογα με το επίπεδο απόδοσης.
*/
#include <iostream>
using namespace std;

int main() {
    int score;
    cout << "Παρακαλώ εισάγετε τον βαθμό σας: ";
    cin >> score;

    if (score >= 90) {
        cout << "Εξαιρετική επίδοση! Βαθμός Α" << endl;
    } else if (score >= 80) {
        cout << "Πολύ καλή επίδοση! Βαθμός Β" << endl;
    } else if (score >= 70) {
        cout << "Καλή επίδοση! Βαθμός Γ" << endl;
    } else if (score >= 60) {
        cout << "Μέτρια επίδοση! Βαθμός Δ" << endl;
    } else {
        cout << "Αδικαιολόγητη επίδοση! Βαθμός Ε" << endl;
    }

    return 0;
}

