/*Παράδειγμα με την λίστα της STL.

Το πρόγραμμα δημιουργεί μια λίστα από αντικείμενα της κλάσης MyClass. Η κλάση MyClass περιέχει τρεις ιδιωτικές μεταβλητές x, y και n, 
καθώς και μεθόδους για την εκτύπωση, την αλλαγή των τιμών και τον κατασκευαστή και καταστροφέα του αντικειμένου.

Αρχικά, δημιουργούνται τρία αντικείμενα v1, v2 και v3 της κλάσης MyClass με διάφορες τιμές. Στη συνέχεια, τα αντικείμενα εισάγονται 
στη λίστα l με τη χρήση της μεθόδου push_back.

Στη συνέχεια, γίνεται μια αλλαγή των τιμών του αντικειμένου v1 και εκτυπώνονται τα αντικείμενα στη λίστα με τη χρήση του δείκτη il.

Έπειτα, καλείται η συνάρτηση add που δέχεται μια λίστα lll και προσθέτει ένα αντικείμενο tmp στη λίστα.

Στη συνέχεια, εκτυπώνονται ξανά τα αντικείμενα στη λίστα l, αφαιρείται ένα αντικείμενο v2 από τη λίστα, προστίθεται ξανά το v2 στη λίστα, 
διαγράφεται το πρώτο αντικείμενο της λίστας και εκτυπώνονται και πάλι τα υπόλοιπα αντικείμενα.

Τέλος, καθαρίζεται η λίστα και ελέγχεται αν είναι κενή.*/

#include <iostream>
#include <list>
#include <stdio.h>
#include <string.h>

using namespace std;

class MyClass
{
	char *n; // Συμβολοσειρά για αποθήκευση ενός αριθμού ως κείμενο
	int x; // Ακέραια μεταβλητή
	int y; // Ακέραια μεταβλητή
public:
	MyClass (int a, int b) {x = a; y = b; n = new char[10]; sprintf (n, "%d", x + y); cout << "constracting "  << a << " " << b << " " << n << endl;}
	void print () {cout << x << " " << y << " " << n << endl;}
	void set (int a, int b) {x = a; y = b; sprintf (n, "%d", x + y);}
	~MyClass () {cout << "destructing "; print (); delete[] n;}
	MyClass (const MyClass &tmp) {x = tmp.x; y = tmp.y; n = new char [10]; strcpy (n, tmp.n);}
	bool operator== (const MyClass &tmp)
	{
		if (x == tmp.x && y == tmp.y && !strcmp (n, tmp.n))
			return true;
		else
			return false;
	}
};

void add (list <MyClass> );

int main (int argc, char **argv)
{
	list <MyClass> l; // Λίστα από αντικείμενα MyClass
	list <MyClass>::iterator il; // Δείκτης προς αντικείμενο MyClass στη λίστα
	MyClass v1 (1, 1); // Δημιουργία αντικειμένου MyClass με τιμές 1, 1
	MyClass v2 (2, 2); // Δημιουργία αντικειμένου MyClass με τιμές 2, 2
	MyClass v3 (3, 3); // Δημιουργία αντικειμένου MyClass με τιμές 3, 3
	int i;
	cout << "1================================================" << endl;
	l.push_back (v1); // Εισαγωγή του αντικειμένου v1 στη λίστα
	l.push_back (v2); // Εισαγωγή του αντικειμένου v2 στη λίστα
	l.push_back (v3); // Εισαγωγή του αντικειμένου v3 στη λίστα
	cout << "2================================================" << endl;
	v1.set (10, 10); // Αλλαγή των τιμών του αντικειμένου v1 σε 10, 10
	for (il = l.begin (); il != l.end (); il++) // Εκτύπωση όλων των αντικειμένων στη λίστα
		il -> print ();
	il -> print (); // Εκτύπωση του τελευταίου αντικειμένου στη λίστα
	cout << "3================================================" << endl;
	add (l); // Κλήση της συνάρτησης add για εισαγωγή ενός αντικειμένου στη λίστα
	cout << "4================================================" << endl;
	for (il = l.begin (); il != l.end (); il++) // Εκτύπωση όλων των αντικειμένων στη λίστα
		il -> print ();
	cout << "5================================================" << endl;
	l.remove (v2); // Αφαίρεση του αντικειμένου v2 από τη λίστα
	for (il = l.begin (); il != l.end (); il++) // Εκτύπωση όλων των αντικειμένων στη λίστα
		il -> print ();
	cout << "6================================================" << endl;
	il = l.begin ();
	l.insert (il, v2); // Εισαγωγή του αντικειμένου v2 στη λίστα στη θέση που δείχνει ο δείκτης il
	for (il = l.begin (); il != l.end (); il++) // Εκτύπωση όλων των αντικειμένων στη λίστα
		il -> print ();
	cout << "7================================================" << endl;
	il = l.begin ();
	l.erase (il); // Διαγραφή του αντικειμένου στη θέση που δείχνει ο δείκτης il
	for (il = l.begin (); il != l.end (); il++) // Εκτύπωση όλων των αντικειμένων στη λίστα
		il -> print ();
	cout << "8================================================" << endl;
	l.clear (); // Καθαρισμός της λίστας (αφαίρεση όλων των στοιχείων)
	il = l.begin ();
	if (il == l.end ())
		cout << "NULL" << endl ;
	cout << "9================================================" << endl;
}

void add (list <MyClass> lll)
{
	MyClass  tmp (1000, 1000);
	lll.push_back (tmp); // Εισαγωγή του αντικειμένου tmp στη λίστα lll
}
