/*
Αντιγραφή αρχείων στη cpp	
Το πρόγραμμα αντιγράφει τα περιεχόμενα ενός αρχείου σε ένα άλλο αρχείο. 
Οι παράμετροι εκτέλεσης πρέπει να είναι τα ονόματα των αρχείων πηγής και προορισμού. 
Το πρόγραμμα χρησιμοποιεί αντικείμενα fstream για το άνοιγμα και την επεξεργασία των αρχείων.
Κατά την εκτέλεση, το πρόγραμμα ελέγχει αν δόθηκαν σωστές παράμετροι εκτέλεσης (όνομα αρχείου πηγής και αρχείου προορισμού). 
Στη συνέχεια, ανοίγει το αρχείο πηγής και το αρχείο προορισμού με κατάλληλες λειτουργίες (ανάγνωση για το αρχείο πηγής και εγγραφή για το αρ
*/

#include <iostream>
#include <fstream>

using namespace std;

int main (int argc, char **argv)
{
    fstream InpF, OutF; // Δημιουργία αντικειμένων fstream για το αρχείο εισόδου και το αρχείο εξόδου
    char Buff[1024]; // Προσωρινός πίνακας για ανάγνωση και εγγραφή δεδομένων
    int Br, TotBr = 0; // Μεταβλητή για την αποθήκευση του αριθμού διαβασμένων bytes και του συνολικού αριθμού bytes
    
    if (argc != 3) // Έλεγχος αν έχουν δοθεί σωστές παράμετροι εκτέλεσης
    {
        cout << "syntax: " << argv[0] << " <source file> <destination file>" << endl;
        exit (1);
    }
    
    InpF.open (argv[1], ios::in | ios::binary); // Άνοιγμα αρχείου εισόδου σε λειτουργία ανάγνωσης και δυαδικής μορφής
    if (!InpF.good ()) // Έλεγχος αν έχει γίνει σωστά το άνοιγμα του αρχείου εισόδου
    {
        cout << "Cannot open source file..." << endl;
        exit (2);
    }
    
    OutF.open (argv[2], ios::out | ios::binary); // Άνοιγμα αρχείου εξόδου σε λειτουργία εγγραφής και δυαδικής μορφής
    if (!OutF.good ()) // Έλεγχος αν έχει γίνει σωστά το άνοιγμα του αρχείου εξόδου
    {
        cout << "Cannot open destination file..." << endl;
        exit (2);
    }
    
    do
    {
        InpF.read (Buff, 100); // Διάβασμα δεδομένων από το αρχείο εισόδου και αποθήκευσή τους στον πίνακα Buff
        TotBr += Br = InpF.gcount (); // Αποθήκευση του αριθμού των διαβασμένων bytes και ενημέρωση του συνολικού αριθμού bytes
        if (Br)
            OutF.write (Buff, Br); // Εγγραφή των διαβασμένων bytes από τον πίνακα Buff στο αρχείο εξόδου
    }
    while (Br); // Επανάληψη μέχρι να διαβαστούν όλα τα bytes από το αρχείο εισόδου
    
    InpF.close (); // Κλείσιμο του αρχείου εισόδου
    OutF.close (); // Κλείσιμο του αρχείου εξόδου
    
    cout << TotBr << " bytes copied" << endl; // Εκτύπωση του συνολικού αριθμού αντιγραμμένων bytes
}
