/*
Η συνάρτηση Check1 δημιουργεί ένα αρχείο με όνομα "File1.txt" αν δεν υπάρχει ή το σβήνει αν υπάρχει ήδη.

Η συνάρτηση Check2 ανοίγει ένα αρχείο με όνομα "File.txt" με λειτουργίες εισόδου και εξόδου και την λειτουργία ios::trunc, 
η οποία σβήνει το περιεχόμενο του αρχείου αν υπάρχει ήδη. Αν το αρχείο δεν υπάρχει, τότε δημιουργείται και αμέσως σβήνεται.

Η συνάρτηση Check3 ανοίγει ένα αρχείο με όνομα "File.txt" με λειτουργίες εισόδου και εξόδου και την λειτουργία ios::app, 
η οποία επιτρέπει να γράφονται δεδομένα στο τέλος του αρχείου χωρίς να διαγράφεται το υπάρχον περιεχόμενο. 
Στη συνέχεια, γίνεται εγγραφή του κειμένου "123" στο αρχείο και εκτυπώνεται η κατάσταση του αρχείου (καλή ή κακή). 
Έπειτα, γίνεται μετακίνηση της θέσης εγγραφής στην αρχή του αρχείου με την seekp και ξαναεγγράφεται το κείμενο "456". 
Και πάλι εκτυπώνεται η κατάσταση του αρχείου και τέλος κλείνει.
*/


#include <iostream>
#include <fstream>

using namespace std;

// Σβήνει το αρχείο αν υπάρχει, δημιουργεί το αρχείο αν δεν υπάρχει
void Check1 ()
{
    fstream F ("File1.txt", ios::out); // Άνοιγμα αρχείου εξόδου με την λειτουργία ios::out
    F.close (); // Κλείσιμο του αρχείου
}

// Αν υπάρχει το αρχείο, δεν το σβήνει χωρίς το trunc, αλλά το σβήνει με το trunc
// Αν δεν υπάρχει το αρχείο, δεν το δημιουργεί χωρίς το trunc, αλλά το δημιουργεί με το trunc
void Check2 ()
{
    fstream F ("File.txt", ios::in | ios::out | ios::trunc); // Άνοιγμα αρχείου εισόδου και εξόδου με τη λειτουργία ios::trunc
    F.close (); // Κλείσιμο του αρχείου
}

// Με τη λειτουργία ios::app δεν γράφει πίσω, με τη λειτουργία ios::ate ξεκινάει στο τέλος αλλά γράφει πίσω
void Check3 ()
{
    fstream F ("File.txt", ios::in | ios::out | ios::app); // Άνοιγμα αρχείου εισόδου και εξόδου με τις λειτουργίες ios::app
    F << "123"; // Εγγραφή του κειμένου "123" στο αρχείο
    cout << F.good (); // Έλεγχος αν η κατάσταση του αρχείου είναι καλή
    F.seekp (0); // Αλλαγή της θέσης εγγραφής στην αρχή του αρχείου
    cout << F.good (); // Έλεγχος αν η κατάσταση του αρχείου είναι καλή
    F << "456"; // Εγγραφή του κειμένου "456" στο αρχείο
    cout << F.good (); // Έλεγχος αν η κατάσταση του αρχείου είναι καλή
    F.close (); // Κλείσιμο του αρχείου
}

int main (int argc, char **argv)
{
    Check1 (); // Κλήση της συνάρτησης Check1
    //Check2 (); // Κλήση της συνάρτησης Check2
    //Check3 (); // Κλήση της συνάρτησης Check3
}
