#include <iostream>
#include <fstream> // Για τη χρήση της ofstream

using namespace std;

int main() {
    // Δημιουργία ενός αντικειμένου ofstream και άνοιγμα ενός αρχείου για εγγραφή
    ofstream outFile("example.txt");

    // Έλεγχος αν το αρχείο άνοιξε επιτυχώς
    if (!outFile) {
        cerr << "Δεν ήταν δυνατή η δημιουργία του αρχείου." << endl;
        return 1;
    }

    // Εγγραφή δεδομένων στο αρχείο
    outFile << "Αυτή είναι η πρώτη γραμμή στο αρχείο." << endl;
    outFile << "Αυτή είναι η δεύτερη γραμμή στο αρχείο." << endl;
    outFile << "Και αυτή είναι η τρίτη γραμμή στο αρχείο." << endl;

    // Κλείσιμο του αρχείου
    outFile.close();

    // Έλεγχος αν το αρχείο έκλεισε επιτυχώς
    if (outFile.fail()) {
        cerr << "Υπήρξε πρόβλημα με το κλείσιμο του αρχείου." << endl;
        return 1;
    }

    cout << "Το αρχείο δημιουργήθηκε και τα δεδομένα εγγράφηκαν επιτυχώς." << endl;

    return 0;
}
